Ctrl + Enter will execute a cell

Shift + Enter will execute the current cell and move selection to below cell

Alt + Enter will execute and insert a new cell below

Key A will insert cell above

Key B will insert cell below

Key D D to delete

In [86]:
import pandas as pd
import numpy as np

#### Read csv file

In [123]:
def date_conv(x):
    return pd.to_datetime(str(x), format='%Y%m%d')

In [147]:
df1=pd.read_csv("input_csv.csv",dtype={"dob":str})
df1

   id   name       dob
0   1    Bob  19800228
1   2  Alice  19851003
2   3  Carol  20000405

In [150]:
pd.read_csv("input_csv.csv",parse_dates=["dob"],date_parser=date_conv)#.info()

   id   name        dob
0   1    Bob 1980-02-28
1   2  Alice 1985-10-03
2   3  Carol 2000-04-05

#### Select row and column with iloc(row_range,column_range)

In [222]:
df1.iloc[2:3,1:3]

    name       dob
2  Carol  20000405

In [210]:
df1[["name"]]

    name
0    Bob
1  Alice
2  Carol

#### Read csv file

In [233]:
df2=pd.read_fwf("input_fwf.txt",colspecs=[(0,3),(3,24)],names=["id","email"])
df2

   id                 email
0   2  alice.work@email.com
1   3        carol@mail.com
2   2  alice.home@email.com
3   3      carol.g@mail.com
4   3     carol.f@gmail.com
5   4  some.one@nowhere.com

#### Different types of merges

In [279]:
common=df1.merge(df2,on=["id"],how="inner")
common

   id   name       dob                 email
0   2  Alice  19851003  alice.work@email.com
1   2  Alice  19851003  alice.home@email.com
2   3  Carol  20000405        carol@mail.com
3   3  Carol  20000405      carol.g@mail.com
4   3  Carol  20000405     carol.f@gmail.com

In [139]:
df1.merge(df2,on=["id"],how="left",indicator=True)\
   .query("_merge=='left_only'")[["id","name","dob"]]\
   .to_csv("People without email.csv",index=False)

In [140]:
df1.merge(df2,on=["id"],how="right",indicator=True)\
   .query("_merge=='right_only'")[["id","email"]]\
   .to_csv("Orphan Emails.csv",index=False)

In [141]:
df1.merge(df2,on=["id"],how="outer",indicator=True)

   id   name       dob                 email      _merge
0   1    Bob  19800228                   NaN   left_only
1   2  Alice  19851003  alice.work@email.com        both
2   3  Carol  20000405        carol@mail.com        both
3   4    NaN       NaN  some.one@nowhere.com  right_only

#### Write a csv file

In [280]:
common.to_csv("Common.csv",index=False)

#### Add a column to the dataframe

In [277]:
common["email_caps"]=common["email"].str.upper()

In [278]:
common

,id,name,dob,email,email_count,email_caps
0,2,Alice,19851003,alice.work@email.com,2,ALICE.WORK@EMAIL.COM
1,2,Alice,19851003,alice.home@email.com,2,ALICE.HOME@EMAIL.COM
2,3,Carol,20000405,carol@mail.com,3,CAROL@MAIL.COM
3,3,Carol,20000405,carol.g@mail.com,3,CAROL.G@MAIL.COM
4,3,Carol,20000405,carol.f@gmail.com,3,CAROL.F@GMAIL.COM

***

#### Group by, Transform, apply, applymap feature

In [235]:
common

   id   name       dob                 email
0   2  Alice  19851003  alice.work@email.com
1   2  Alice  19851003  alice.home@email.com
2   3  Carol  20000405        carol@mail.com
3   3  Carol  20000405      carol.g@mail.com
4   3  Carol  20000405     carol.f@gmail.com

In [262]:
common.groupby(by=["id"])["email"].count()#.rename("count").reset_index()

id
2    2
3    3
Name: email, dtype: int64

In [249]:
common["email_count"]=common.groupby(by=["id"])["email"].transform("count")

In [250]:
common

   id   name       dob                 email  email_count
0   2  Alice  19851003  alice.work@email.com            2
1   2  Alice  19851003  alice.home@email.com            2
2   3  Carol  20000405        carol@mail.com            3
3   3  Carol  20000405      carol.g@mail.com            3
4   3  Carol  20000405     carol.f@gmail.com            3

#### Apply a function column-wise or row-wise

In [267]:
def str_cat(x):
    string=""
    for i in x:
        string = string + str(i)
    return string

In [270]:
common.apply(str_cat,axis=0)

id                                                         22333
name                                   AliceAliceCarolCarolCarol
dob                     1985100319851003200004052000040520000405
email          alice.work@email.comalice.home@email.comcarol@...
email_count                                                22333
dtype: object

In [271]:
common.apply(str_cat,axis=1)

0    2Alice19851003alice.work@email.com2
1    2Alice19851003alice.home@email.com2
2          3Carol20000405carol@mail.com3
3        3Carol20000405carol.g@mail.com3
4       3Carol20000405carol.f@gmail.com3
dtype: object

#### Apply a function on every cell in the dataframe

In [272]:
def len_str(x):
    return len(str(x))

In [273]:
common.applymap(len_str)

   id  name  dob  email  email_count
0   1     5    8     20            1
1   1     5    8     20            1
2   1     5    8     14            1
3   1     5    8     16            1
4   1     5    8     17            1

# Markup features

M will make a cell mark down and Y will make it code

#### Markup text can be written in cells. Heading can be written like below.

# Heading
## Heading smaller
### Even smaller
#### Smallest

***

Make text **bold** using **

Make text _italics_ using _

***

#### Links can be created like this

[Link](#Page-Bottom)

***

#### List can be created using hyphen

- Item 1
- Item 2
- Item 3

- [ ] Item 1
- [ ] Item 2
- [ ] Item 3

1. Numbered Item 1
2. Numbered Item 2
3. Numbered Item 3

#### Table can be created like below

|Header|Header|Header|
|------|------|----|
|A     |B     |C     |
|X     |Y     |Z     |

***

#### Note can be created like this

> This is something important

#### Monospaced text

```
01 WS-TEXT-1     PIC X(1)
01 WS-TEXT-2     PIC X(3)
01 WS-TEXT-3     PIC X(4)
```

***

#### Advanced formatting can be done using HTML

<div class="alert alert-block alert-info">
<b>Tip:</b> Use blue boxes (alert-info) for tips and notes. 
If it’s a note, you don’t have to include the word “Note”.
</div>

# Page Bottom